// 手动文章列表配置
// 自动配置于 2025-01-08

module.exports = {
    // 启用手动文章列表
    useManualPosts: true,

    // 手动添加的文章 ID 列表
    manualPostIds: [
    '2aa1a5ec32f680a1bcc9d9ad42186e55', // TCP 协议 - 网络世界的"靠谱快递员" 📦 - 2025-11-14,
    '2aa1a5ec32f680658d65f6b2c7060dc9', // React query 服务器端渲染 - 2025-11-13,
    '2a91a5ec32f680a0b31fd492b96a40e4', // 流(Stream)？听起来像是在看视频，其实差不多！ - 2025-11-12,
    '2a41a5ec32f680f39be1e8f9714a1d1a', // Immer 实战指南 - 2025-11-07,
    '2a31a5ec32f680919073c56f7b51ec93', // React Query 离线支持 - 2025-11-06,
    '2a21a5ec32f6807e8b1ffa67285b2e8a', // React Query 乐观更新 - 2025-11-05,
    '2a21a5ec32f680b98ac5df8a0eebd8ed', // React Query 管理突变 - 2025-11-05,
    '2a21a5ec32f680e2b993fa8300483101', // React Query 无限查询 - 2025-11-05,
    '2a21a5ec32f680b48734cb2c856823bf', // React Query 分页 - 2025-11-05,
    '2a21a5ec32f68020aab0d5e3fc9f7ada', // React Query 避免加载状态 - 2025-11-05,
    '2a21a5ec32f680b9a4b7f9f3ce40030a', // React Query 依赖查询 - 2025-11-05,
    '2a21a5ec32f6802b9ac9c92ae7733c62', // React Query 轮询 - 2025-11-05,
    '2a21a5ec32f680b1bc99fd7c58ddc041', // React Query 垃圾回收 - 2025-11-05,
    '2a21a5ec32f680fba595d23354a83a96', // React Query 按需查询 - 2025-11-05,
    '2a11a5ec32f6806ba2deca8ae1d46520', // React Query 动态参数 - 2025-11-04,
    '2a11a5ec32f680b68f8bc8ded4f0b47f', // React Query 的底层魔法揭秘 - 2025-11-04,
    '2a11a5ec32f6806da758fd089790958e', // React Query 查询的三阶段 - 2025-11-04,
    '2a11a5ec32f680498089fb8a15c22eb3', // 为什么要用 React query（清嗓子，扶了扶眼镜，开始敲键盘） - 2025-11-04,
    '29c1a5ec32f680578d5bd010c4d4d4a0', // Refactoring UI 第二章“层次就是一切” - 2025-10-30,
    '29b1a5ec32f680a59e2ffd10108b6f2a', // Refactoring UI - 第一章 从头开始-幽默的总结 - 2025-10-29,
    '2951a5ec32f6800aa11cdaf191ccd083', // React Hook Form API 详细中文文档 - 2025-10-23,
    '2931a5ec32f680eab615d966b344e7e0', // 前端项目构建-初始化项目 - 2025-10-21,
    '28c1a5ec32f680e2956ad7280b75a0b0', // React 代码片段快捷方式完整指南 - 2025-10-15,
    '2881a5ec32f68076ab5ad23b4047eacf', // Typescript 内置 23个泛型工具 - 2025-10-10,
    '2871a5ec32f680f2a070fdeacb7731b3', // xxx - 2025-10-09,
        '26d1a5ec32f680c1ad6ee9d775c87385', // Nobelium+Zapier+Vercel 构建一个属于自己的博客
        '2861a5ec32f680709903defcf682fbd4', // Cloud Code 基础的能技巧
        '2871a5ec32f6807ea125dd25d15e2a69', // Typescript 学习笔记 (一)
    ],
}

